#### 📖 Terraform Plan ('infra/resources/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl
Error: Invalid for_each argument

  on ../_modules/web_apps/ops_func.tf line 51, in resource "azurerm_role_assignment" "message_content_container_contributor":
  51:   for_each = toset([
  52:     module.ops_func.function_app.function_app.principal_id,
  53:     module.ops_func.function_app.function_app.slot.principal_id
  54:   ])
    ├────────────────
    │ module.ops_func.function_app.function_app.principal_id is a string, known only after apply
    │ module.ops_func.function_app.function_app.slot.principal_id is null

The "for_each" set includes values derived from resource attributes that
cannot be determined until apply, and so Terraform cannot determine the full
set of keys that will identify the instances of this resource.

When working with unknown values in for_each, it's better to use a map value
where the keys are defined statically in your configuration and where only
the values contain apply-time results.

Alternatively, you could use the -target planning option to first apply only
the resources that the for_each value depends on, and then apply a second
time to fully converge.
1/providers/Microsoft.Network/privateEndpoints/io-p-itn-com-citizen-func-pep-01]
module.web_apps.module.etl_func_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.web_apps.module.citizen_func_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.read_ops_func will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "read_ops_func" {
      + account_name        = "io-p-cosmos-api"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = (known after apply)
      + resource_group_name = "io-p-rg-internal"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api"
    }

  # module.web_apps.azurerm_cosmosdb_sql_role_assignment.write_ops_func will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "write_ops_func" {
      + account_name        = "io-p-cosmos-api"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = (known after apply)
      + resource_group_name = "io-p-rg-internal"
      + role_definition_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api/sqlRoleDefinitions/00000000-0000-0000-0000-000000000003"
      + scope               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api"
    }

  # module.eventhubs.module.etl.azurerm_eventhub.events["io-p-itn-com-etl-message-status-evh-01"] will be destroyed
  # (because key ["io-p-itn-com-etl-message-status-evh-01"] is not in for_each map)
  - resource "azurerm_eventhub" "events" {
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.EventHub/namespaces/io-p-itn-com-etl-evhns-01/eventhubs/io-p-itn-com-etl-message-status-evh-01" -> null
      - message_retention   = 7 -> null
      - name                = "io-p-itn-com-etl-message-status-evh-01" -> null
      - namespace_id        = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.EventHub/namespaces/io-p-itn-com-etl-evhns-01" -> null
      - namespace_name      = "io-p-itn-com-etl-evhns-01" -> null
      - partition_count     = 32 -> null
      - partition_ids       = [
          - "0",
          - "1",
          - "10",
          - "11",
          - "12",
          - "13",
          - "14",
          - "15",
          - "16",
          - "17",
          - "18",
          - "19",
          - "2",
          - "20",
          - "21",
          - "22",
          - "23",
          - "24",
          - "25",
          - "26",
          - "27",
          - "28",
          - "29",
          - "3",
          - "30",
          - "31",
          - "4",
          - "5",
          - "6",
          - "7",
          - "8",
          - "9",
        ] -> null
      - resource_group_name = "io-p-itn-com-rg-01" -> null
      - status              = "Active" -> null
    }

  # module.eventhubs.module.etl.azurerm_eventhub.events["io-p-itn-com-etl-messages-evh-01"] will be destroyed
  # (because key ["io-p-itn-com-etl-messages-evh-01"] is not in for_each map)
  - resource "azurerm_eventhub" "events" {
      - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.EventHub/namespaces/io-p-itn-com-etl-evhns-01/eventhubs/io-p-itn-com-etl-messages-evh-01" -> null
      - message_retention   = 7 -> null
      - name                = "io-p-itn-com-etl-messages-evh-01" -> null
      - namespace_id        = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.EventHub/namespaces/io-p-itn-com-etl-evhns-01" -> null
      - namespace_name      = "io-p-itn-com-etl-evhns-01" -> null
      - partition_count     = 32 -> null
      - partition_ids       = [
          - "0",
          - "1",
          - "10",
          - "11",
          - "12",
          - "13",
          - "14",
          - "15",
          - "16",
          - "17",
          - "18",
          - "19",
          - "2",
          - "20",
          - "21",
          - "22",
          - "23",
          - "24",
          - "25",
          - "26",
          - "27",
          - "28",
          - "29",
          - "3",
          - "30",
          - "31",
          - "4",
          - "5",
          - "6",
          - "7",
          - "8",
          - "9",
        ] -> null
      - resource_group_name = "io-p-itn-com-rg-01" -> null
      - status              = "Active" -> null
    }

  # module.eventhubs.module.etl.azurerm_eventhub.events["io-p-itn-com-message-status-evh-01"] will be created
  + resource "azurerm_eventhub" "events" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "io-p-itn-com-message-status-evh-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "io-p-itn-com-etl-evhns-01"
      + partition_count     = 32
      + partition_ids       = (known after apply)
      + resource_group_name = "io-p-itn-com-rg-01"
      + status              = "Active"
    }

  # module.eventhubs.module.etl.azurerm_eventhub.events["io-p-itn-com-messages-evh-01"] will be created
  + resource "azurerm_eventhub" "events" {
      + id                  = (known after apply)
      + message_retention   = 7
      + name                = "io-p-itn-com-messages-evh-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "io-p-itn-com-etl-evhns-01"
      + partition_count     = 32
      + partition_ids       = (known after apply)
      + resource_group_name = "io-p-itn-com-rg-01"
      + status              = "Active"
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-etl-message-status-evh-01.io-messages"] will be destroyed
  # (because key ["io-p-itn-com-etl-message-status-evh-01.io-messages"] is not in for_each map)
  - resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      - eventhub_name                     = "io-p-itn-com-etl-message-status-evh-01" -> null
      - id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.EventHub/namespaces/io-p-itn-com-etl-evhns-01/eventhubs/io-p-itn-com-etl-message-status-evh-01/authorizationRules/io-messages" -> null
      - listen                            = false -> null
      - manage                            = false -> null
      - name                              = "io-messages" -> null
      - namespace_name                    = "io-p-itn-com-etl-evhns-01" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_key                       = (sensitive value) -> null
      - resource_group_name               = "io-p-itn-com-rg-01" -> null
      - secondary_connection_string       = (sensitive value) -> null
      - secondary_key                     = (sensitive value) -> null
      - send                              = true -> null
        # (2 unchanged attributes hidden)
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-etl-message-status-evh-01.pdnd"] will be destroyed
  # (because key ["io-p-itn-com-etl-message-status-evh-01.pdnd"] is not in for_each map)
  - resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      - eventhub_name                     = "io-p-itn-com-etl-message-status-evh-01" -> null
      - id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.EventHub/namespaces/io-p-itn-com-etl-evhns-01/eventhubs/io-p-itn-com-etl-message-status-evh-01/authorizationRules/pdnd" -> null
      - listen                            = true -> null
      - manage                            = false -> null
      - name                              = "pdnd" -> null
      - namespace_name                    = "io-p-itn-com-etl-evhns-01" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_key                       = (sensitive value) -> null
      - resource_group_name               = "io-p-itn-com-rg-01" -> null
      - secondary_connection_string       = (sensitive value) -> null
      - secondary_key                     = (sensitive value) -> null
      - send                              = false -> null
        # (2 unchanged attributes hidden)
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-etl-messages-evh-01.io-messages"] will be destroyed
  # (because key ["io-p-itn-com-etl-messages-evh-01.io-messages"] is not in for_each map)
  - resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      - eventhub_name                     = "io-p-itn-com-etl-messages-evh-01" -> null
      - id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.EventHub/namespaces/io-p-itn-com-etl-evhns-01/eventhubs/io-p-itn-com-etl-messages-evh-01/authorizationRules/io-messages" -> null
      - listen                            = false -> null
      - manage                            = false -> null
      - name                              = "io-messages" -> null
      - namespace_name                    = "io-p-itn-com-etl-evhns-01" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_key                       = (sensitive value) -> null
      - resource_group_name               = "io-p-itn-com-rg-01" -> null
      - secondary_connection_string       = (sensitive value) -> null
      - secondary_key                     = (sensitive value) -> null
      - send                              = true -> null
        # (2 unchanged attributes hidden)
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-etl-messages-evh-01.pdnd"] will be destroyed
  # (because key ["io-p-itn-com-etl-messages-evh-01.pdnd"] is not in for_each map)
  - resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      - eventhub_name                     = "io-p-itn-com-etl-messages-evh-01" -> null
      - id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.EventHub/namespaces/io-p-itn-com-etl-evhns-01/eventhubs/io-p-itn-com-etl-messages-evh-01/authorizationRules/pdnd" -> null
      - listen                            = true -> null
      - manage                            = false -> null
      - name                              = "pdnd" -> null
      - namespace_name                    = "io-p-itn-com-etl-evhns-01" -> null
      - primary_connection_string         = (sensitive value) -> null
      - primary_key                       = (sensitive value) -> null
      - resource_group_name               = "io-p-itn-com-rg-01" -> null
      - secondary_connection_string       = (sensitive value) -> null
      - secondary_key                     = (sensitive value) -> null
      - send                              = false -> null
        # (2 unchanged attributes hidden)
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-message-status-evh-01.io-messages"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-message-status-evh-01"
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "io-messages"
      + namespace_name                    = "io-p-itn-com-etl-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-message-status-evh-01.pdnd"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-message-status-evh-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "pdnd"
      + namespace_name                    = "io-p-itn-com-etl-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-messages-evh-01.io-messages"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-messages-evh-01"
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "io-messages"
      + namespace_name                    = "io-p-itn-com-etl-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.eventhubs.module.etl.azurerm_eventhub_authorization_rule.authorization_rule["io-p-itn-com-messages-evh-01.pdnd"] will be created
  + resource "azurerm_eventhub_authorization_rule" "authorization_rule" {
      + eventhub_name                     = "io-p-itn-com-messages-evh-01"
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "pdnd"
      + namespace_name                    = "io-p-itn-com-etl-evhns-01"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + resource_group_name               = "io-p-itn-com-rg-01"
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.web_apps.module.citizen_func_autoscaler.azurerm_monitor_autoscale_setting.this will be updated in-place
  ~ resource "azurerm_monitor_autoscale_setting" "this" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Insights/autoScaleSettings/io-p-itn-com-citizen-as-01"
        name                = "io-p-itn-com-citizen-as-01"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

      ~ profile {
            name = jsonencode(
                {
                    for  = "low_load_profile"
                    name = "default"
                }
            )

          ~ capacity {
              ~ minimum = 3 -> 6
                # (2 unchanged attributes hidden)
            }

          ~ rule {
              ~ metric_trigger {
                  ~ threshold                = 25 -> 80
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ threshold                = 10 -> 20
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.web_apps.module.ops_func.azurerm_linux_function_app.this will be created
  + resource "azurerm_linux_function_app" "this" {
      + app_settings                                   = {
          + "APPINSIGHTS_SAMPLING_PERCENTAGE"                                                                  = "5"
          + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage" = "5"
          + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage"     = "5"
          + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage"     = "5"
          + "COMMON_STORAGE_ACCOUNT_URL"                                                                       = "https://iopstapi.blob.core.windows.net/"
          + "COSMOS_DATABASE_NAME"                                                                             = "io-p-cosmos-api"
          + "COSMOS_URI"                                                                                       = "https://io-p-cosmos-api.documents.azure.com:443/"
          + "FUNCTIONS_WORKER_PROCESS_COUNT"                                                                   = "1"
          + "SLOT_TASK_HUBNAME"                                                                                = "ProductionTaskHub"
          + "STORAGE_ACCOUNT__serviceUri"                                                                      = "https://iopitncomst01.table.core.windows.net/"
          + "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"                                                  = "1"
          + "WEBSITE_DNS_SERVER"                                                                               = "168.63.129.16"
          + "WEBSITE_RUN_FROM_PACKAGE"                                                                         = "1"
          + "WEBSITE_SWAP_WARMUP_PING_PATH"                                                                    = "/api/health"
          + "WEBSITE_SWAP_WARMUP_PING_STATUSES"                                                                = "200,204"
          + "WEBSITE_WARMUP_PATH"                                                                              = "/api/health"
        }
      + builtin_logging_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "italynorth"
      + name                                           = "io-p-itn-com-ops-func-01"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = false
      + resource_group_name                            = "io-p-itn-com-rg-01"
      + service_plan_id                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-com-etl-asp-01"
      + site_credential                                = (sensitive value)
      + storage_account_name                           = "iopitncomopsstfn01"
      + storage_uses_managed_identity                  = true
      + tags                                           = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      + virtual_network_subnet_id                      = (known after apply)
      + vnet_image_pull_enabled                        = false
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = true
          + app_scale_limit                         = (known after apply)
          + application_insights_connection_string  = (sensitive value)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = 2
          + health_check_path                       = "/api/health"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Deny"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = true
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version                = "20"
              + use_dotnet_isolated_runtime = false
            }
        }

      + sticky_settings {
          + app_setting_names = [
              + "SLOT_TASK_HUBNAME",
              + "AzureFunctionsJobHost__extensions__durableTask__hubName",
              + "APPINSIGHTS_SAMPLING_PERCENTAGE",
              + "AzureFunctionsWebHost__hostid",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage",
              + "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              + "NODE_ENV",
            ]
        }
    }

  # module.web_apps.module.ops_func.azurerm_private_endpoint.function_sites will be created
  + resource "azurerm_private_endpoint" "function_sites" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-com-ops-func-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-com-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.azurewebsites.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-com-ops-func-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "sites",
            ]
        }
    }

  # module.web_apps.module.ops_func.azurerm_private_endpoint.st_blob will be created
  + resource "azurerm_private_endpoint" "st_blob" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-com-ops-blob-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-com-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-com-ops-blob-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.web_apps.module.ops_func.azurerm_private_endpoint.st_file will be created
  + resource "azurerm_private_endpoint" "st_file" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-com-ops-file-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-com-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-com-ops-file-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "file",
            ]
        }
    }

  # module.web_apps.module.ops_func.azurerm_private_endpoint.st_queue will be created
  + resource "azurerm_private_endpoint" "st_queue" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "io-p-itn-com-ops-queue-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "io-p-itn-com-rg-01"
      + subnet_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01"
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "io-p-itn-com-ops-queue-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "queue",
            ]
        }
    }

  # module.web_apps.module.ops_func.azurerm_role_assignment.function_storage_account_contributor will be created
  + resource "azurerm_role_assignment" "function_storage_account_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.module.ops_func.azurerm_role_assignment.function_storage_blob_data_owner will be created
  + resource "azurerm_role_assignment" "function_storage_blob_data_owner" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.module.ops_func.azurerm_role_assignment.function_storage_queue_data_contributor will be created
  + resource "azurerm_role_assignment" "function_storage_queue_data_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.module.ops_func.azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = true
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "italynorth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "iopitncomopsstfn01"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = false
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "io-p-itn-com-rg-01"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = false
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.web_apps.module.ops_func.azurerm_storage_account_network_rules.st_network_rules will be created
  + resource "azurerm_storage_account_network_rules" "st_network_rules" {
      + bypass             = [
          + "AzureServices",
          + "Logging",
          + "Metrics",
        ]
      + default_action     = "Deny"
      + id                 = (known after apply)
      + storage_account_id = (known after apply)
    }

  # module.web_apps.module.ops_func.azurerm_subnet.this[0] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                              = [
          + "10.20.8.0/26",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "io-p-itn-com-ops-func-snet-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "io-p-itn-common-rg-01"
      + virtual_network_name                          = "io-p-itn-common-vnet-01"

      + delegation {
          + name = "default"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.Web/serverFarms"
            }
        }
    }

Plan: 19 to add, 1 to change, 6 to destroy.

Warning: Argument is deprecated

  with module.storage_api_weu.azurerm_storage_container.message_content,
  on ../_modules/storage_accounts/storage_account_api.tf line 32, in resource "azurerm_storage_container" "message_content":
  32:   storage_account_name  = module.storage_api.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 5 more similar warnings elsewhere)
::error::Terraform exited with code 1.
```

</details>
